src/Reports/ОтчётПоНезавершенномуПроизводству/ОтчётПоНезавершенномуПроизводству.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ОтчётПоНезавершенномуПроизводству</name>
</mdclass:Report>

src/AccumulationRegisters/ПередачиВПроизводство/ПередачиВПроизводство.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПередачиВПроизводство</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.ПроизводственноеЗадание</types>
      <types>DocumentRef.МаршрутнаяКарта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидМПЗ</name>
    <type>
      <types>EnumRef.ВидыМПЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МПЗ</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.Материалы</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/AccumulationRegisters/МестаХранения/МестаХранения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>МестаХранения</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидМПЗ</name>
    <type>
      <types>EnumRef.ВидыМПЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МПЗ</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.Материалы</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Enums/ВидыМПЗ/ВидыМПЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыМПЗ</name>
  <enumValues>
    <name>Материалы</name>
  </enumValues>
  <enumValues>
    <name>Полуфабрикаты</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/ВидыКанбанов/ВидыКанбанов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыКанбанов</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Время</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриЗаменеСоздаватьМТК</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапрещеноПеремещениеВБрак</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РезервироватьВПроизводстве</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеРаскрыватьСпецификациюПриРемонте</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХраненияСписанияНедостачи</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяПриходаИзлишков</name>
    <type>
      <types>CatalogRef.СтатьиПоступленийСписанийПрочих</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеДляСебестоимости</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>СканироватьПриИспользовании</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>МестаХранения</name>
    <attributes>
      <name>МестоХранения</name>
      <type>
        <types>CatalogRef.МестаХранения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоДней</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Reports/ОтчётПоНезавершенномуПроизводству/Forms/ФормаОтчета/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
НаДату = ТекущаяДата();
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
ТаблицаМПЗ.Очистить();
ТабДок.Очистить();
Запрос = Новый Запрос;

ОбъектЗн = РеквизитФормыВЗначение("Отчет");
Макет = ОбъектЗн.ПолучитьМакет("Макет");

ОблШапка = Макет.ПолучитьОбласть("Шапка");
ОблМестоХранения = Макет.ПолучитьОбласть("МестоХранения");
ОблМПЗ = Макет.ПолучитьОбласть("МПЗ");
ОблИтого = Макет.ПолучитьОбласть("Итого");
ОблКонец = Макет.ПолучитьОбласть("Конец");

ОблШапка.Параметры.НаДату = Формат(НаДату,"ДФ=dd.MM.yyyy");
ТабДок.Вывести(ОблШапка);

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПередачиВПроизводствоОстатки.Документ.Линейка.МестоХраненияКанбанов КАК МестоХранения,
	|	ПередачиВПроизводствоОстатки.МПЗ КАК МПЗ,
	|	ПередачиВПроизводствоОстатки.КоличествоОстаток КАК Количество
	|ИЗ
	|	РегистрНакопления.ПередачиВПроизводство.Остатки(&НаДату, ) КАК ПередачиВПроизводствоОстатки";
	Если СписокМестХранения.Количество() > 0 Тогда
	Запрос.Текст = Запрос.Текст + " ГДЕ ПередачиВПроизводствоОстатки.Документ.Линейка.МестоХраненияКанбанов В ИЕРАРХИИ(&СписокМестХранения)";
	Запрос.УстановитьПараметр("СписокМестХранения",СписокМестХранения);
	КонецЕсли;
Запрос.Текст = Запрос.Текст + " ИТОГИ
								|	СУММА(Количество)
								|ПО
								|	МестоХранения,
								|	МПЗ"; 
Запрос.УстановитьПараметр("НаДату",НаДату);
Результат = Запрос.Выполнить();
Результат = Запрос.Выполнить();
ВыборкаМХ = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаМХ.Следующий() Цикл
	ВыборкаМПЗ = ВыборкаМХ.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаМПЗ.Следующий() Цикл		
			Если ТипЗнч(ВыборкаМПЗ.МПЗ) = Тип("СправочникСсылка.Номенклатура") Тогда
				Если ВыборкаМПЗ.МПЗ.Канбан.Пустая() Тогда
				Продолжить;
				КонецЕсли;
	 		ТЧ = ТаблицаМПЗ.Добавить();
			ТЧ.МестоХранения = ВыборкаМХ.МестоХранения;
			ТЧ.МПЗ = ВыборкаМПЗ.МПЗ;
			ТЧ.Количество = ВыборкаМПЗ.Количество;
			ТЧ.Цена = ОбщийМодульВызовСервера.ПолучитьПолнуюСебестоимость(ТЧ.МПЗ,НаДату);
			ТЧ.Сумма = ТЧ.Цена*ТЧ.Количество;
			ТЧ.ВидКанбана = ТЧ.МПЗ.Канбан;		
			ТЧ.ПФ = Истина;
			Иначе
			ТЧ = ТаблицаМПЗ.Добавить();
			ТЧ.МестоХранения = ВыборкаМХ.МестоХранения;
			ТЧ.МПЗ = ВыборкаМПЗ.МПЗ;
			ТЧ.Количество = ВыборкаМПЗ.Количество;
			Код = ТЧ.МПЗ.ПолныйКод();
			ТЧ.Код = СтрЗаменить(Код,"/","-");
			ТЧ.Цена = ОбщийМодульВызовСервера.ПолучитьПоследнююЦену(ТЧ.МПЗ,НаДату);
			ТЧ.Сумма = ТЧ.Цена*ТЧ.Количество;		
			КонецЕсли;		
		КонецЦикла; 
	КонецЦикла; 
Запрос.Текст = 
	"ВЫБРАТЬ
	|	МестаХраненияОстатки.МестоХранения КАК МестоХранения,
	|	МестаХраненияОстатки.МПЗ КАК МПЗ,
	|	МестаХраненияОстатки.КоличествоОстаток КАК Количество
	|ИЗ
	|	РегистрНакопления.МестаХранения.Остатки(&НаДату, ) КАК МестаХраненияОстатки
	|ГДЕ
	|	МестаХраненияОстатки.ВидМПЗ = &ВидМПЗ
	|	И МестаХраненияОстатки.МПЗ.Канбан <> ЗНАЧЕНИЕ(Справочник.ВидыКанбанов.ПустаяСсылка)";
	Если СписокМестХранения.Количество() > 0 Тогда
	Запрос.Текст = Запрос.Текст + " И МестаХраненияОстатки.МестоХранения В ИЕРАРХИИ(&СписокМестХранения)";
	Запрос.УстановитьПараметр("СписокМестХранения",СписокМестХранения);
	КонецЕсли;
Запрос.УстановитьПараметр("НаДату",НаДату);
Запрос.УстановитьПараметр("ВидМПЗ",Перечисления.ВидыМПЗ.Полуфабрикаты);
Результат = Запрос.Выполнить();
ВыборкаДетальныхЗаписей = Результат.Выбрать();
	Пока ВыборкаДетальныхЗаписей.Следующий() Цикл
	Выборка = ТаблицаМПЗ.НайтиСтроки(Новый Структура("МПЗ,МестоХранения",ВыборкаДетальныхЗаписей.МПЗ,ВыборкаДетальныхЗаписей.МестоХранения));
		Если Выборка.Количество() = 0 Тогда
		ТЧ = ТаблицаМПЗ.Добавить();
		ТЧ.МестоХранения = ВыборкаДетальныхЗаписей.МестоХранения;
		ТЧ.МПЗ = ВыборкаДетальныхЗаписей.МПЗ;
		ТЧ.Количество = ВыборкаДетальныхЗаписей.Количество;
			Если ТипЗнч(ТЧ.МПЗ) = Тип("СправочникСсылка.Материалы") Тогда
			Код = ТЧ.МПЗ.ПолныйКод();
			ТЧ.Код = СтрЗаменить(Код,"/","-");
			ТЧ.Цена = ОбщийМодульВызовСервера.ПолучитьПоследнююЦену(ТЧ.МПЗ,НаДату);
			ТЧ.Сумма = ТЧ.Цена*ТЧ.Количество;
			Иначе
			ТЧ.Цена = ОбщийМодульВызовСервера.ПолучитьПолнуюСебестоимость(ТЧ.МПЗ,НаДату);
			ТЧ.Сумма = ТЧ.Цена*ТЧ.Количество; 
			ТЧ.ВидКанбана = ТЧ.МПЗ.Канбан;
			ТЧ.ПФ = Истина;		
			КонецЕсли;		
		Иначе	
		Выборка[0].Количество = Выборка[0].Количество + ВыборкаДетальныхЗаписей.Количество;
		Выборка[0].Сумма = Выборка[0].Цена*Выборка[0].Количество;
		КонецЕсли; 
	КонецЦикла;
ТаблицаМПЗ.Сортировать("МестоХранения,ПФ,МПЗ");
КоличествоИтого = 0;
СуммаИтого = 0;
КоличествоВсего = 0;
СуммаВсего = 0;
ТекМестоХранения = Неопределено;
	Для каждого ТЧ Из ТаблицаМПЗ Цикл	
		Если ТекМестоХранения <> ТЧ.МестоХранения Тогда
			Если ТекМестоХранения <> Неопределено Тогда
			ТабДок.ЗакончитьГруппуСтрок();
			ОблИтого.Параметры.Количество = КоличествоИтого;
			ОблИтого.Параметры.Сумма = СуммаИтого;
			ТабДок.Вывести(ОблИтого);			
			КонецЕсли;
		ОблМестоХранения.Параметры.МестоХранения = ТЧ.МестоХранения;
		ТабДок.Вывести(ОблМестоХранения);
		ТабДок.НачатьГруппуСтрок("МестоХранения",Ложь);
		ТекМестоХранения = ТЧ.МестоХранения;
		КоличествоИтого = 0;
		СуммаИтого = 0;
		КонецЕсли;
	ОблМПЗ.Параметры.МПЗ = ТЧ.МПЗ;
	ОблМПЗ.Параметры.Код = ТЧ.Код;
	ОблМПЗ.Параметры.ЕдиницаИзмерения = СокрЛП(ТЧ.МПЗ.ЕдиницаИзмерения.Наименование);
	ОблМПЗ.Параметры.Цена = ТЧ.Цена;
	ОблМПЗ.Параметры.Количество = ТЧ.Количество;
	ОблМПЗ.Параметры.Сумма = ТЧ.Сумма;
	ОблМПЗ.Параметры.ВидКанбана = ТЧ.ВидКанбана; 
	ОблМПЗ.Параметры.МестоХранения = ТЧ.МестоХранения;  
	ТабДок.Вывести(ОблМПЗ); 
	КоличествоИтого = КоличествоИтого + ТЧ.Количество;
	СуммаИтого = СуммаИтого + ТЧ.Сумма;
	КоличествоВсего = КоличествоВсего + ТЧ.Количество;
	СуммаВсего = СуммаВсего +  ТЧ.Сумма;
	КонецЦикла;
		Если ТекМестоХранения <> Неопределено Тогда
		ТабДок.ЗакончитьГруппуСтрок();
		ОблИтого.Параметры.Количество = КоличествоИтого;
		ОблИтого.Параметры.Сумма = СуммаИтого;
		ТабДок.Вывести(ОблИтого);			
		КонецЕсли;
ОблКонец.Параметры.Количество = КоличествоВсего;
ОблКонец.Параметры.Сумма = СуммаВсего;
ТабДок.Вывести(ОблКонец);  
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
СформироватьНаСервере();
КонецПроцедуры
